<?php

/**
 * setting.inc.php 一些可能扩展的运营参数
 *
 * @version       v0.01
 * @create time   2014/9/2
 * @update time   
 * @author        jt
 * @copyright     Copyright (c) 芝麻开发 (http://www.zhimawork.com)
 */

//管理员分类
$ARRAY_admin_type = array(
	'0' => '只读管理员组',

    '2' => '可续写管理员',
	'9' => '超级管理员'
);
$Degree_type = array(
    '0' => '其他',
    '1' => '专科',
    '2' => '本科',
    '3' => '研究生'

);
$Depart_type = array(
    '0' => '其他',
    '1' => '石油工程学院',
    '2' => '地球科学与工程学院',
    '3' => '化学化工学院',
    '4' => '电子工程学院',
    '5' => '机械工程学院',
    '6' => '材料科学与工程学院',
    '7' => '计算机学院',
    '8' => '理学院',
    '9' => '马克思主义学院',
    '10' => '经济管理学院',
    '11' => '人文学院',
    '12' => '外国语学院',
    '13' => '体育系',
    '14' => '音乐系',
    '15' => '国际教育学院(丝路能源学院)',
    '16' => '继续教育学院'
);
$Group_type = array(
    '0' => '其他',
    '1' => '各地校友分会',
    '2' => '院系校友分会',
    '3' => '校友企业家分会',
    '4' => '厅局级干部'
);
$Contact_type = array(
    '0' => '无',
    '1' => '有单位信息',
    '2' => '有联系方式',
    '3' => '有通讯地址',
    '4' => '有邮箱地址',
    '5' => '有QQ号码',
    '6' => '有微信号码'
);
$time_type = range(1960,2050);
?>